###NumPy

In [4]:
# 1
import numpy as np
A = np.array([[1, 6],
              [2, 8],
              [3, 11],
              [3, 10],
              [1, 7]])
mean_a = np.array([A[:, 0].mean(), A[:, 1].mean()])
mean_a

array([2. , 8.4])

In [5]:
# 2
a_centered = A - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

In [43]:
# 3
a_centered_sp = a_centered[:, 0] @ a_centered[:, 1]
a_magic = a_centered_sp / (A.shape[0] - 1)
a_centered_sp

8.0

In [44]:
# 4
a_cov = np.cov(A.T)[0, 1]
a_magic, a_magic == a_cov

(2.0, True)

### Pandas

In [24]:
# 1
import pandas as pd
authors  = pd.DataFrame({
    "author_id": [1, 2, 3],
    "author_name":  ['Тургенев', 'Чехов', 'Островский']})
book = pd.DataFrame({
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]})
print(authors, '\n', book)

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский
    author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [26]:
# 2
authors_price = pd.merge(authors, book, on='author_id')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [27]:
# 3
top5 = authors_price.nlargest(5, "price")
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [30]:
# 4
authors_stat = authors_price.groupby('author_name').agg({'price':['min', 'max', 'mean']})
authors_stat.reset_index(inplace=True)
authors_stat

  author_name price
                min  max        mean
0  Островский   290  370  330.000000
1    Тургенев   300  450  366.666667
2       Чехов   450  500  475.000000

In [35]:
# 5
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum)
book_info.fillna(0, inplace=True)
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0